'''
Created on 2019年8月17日

@author: lingyulong
'''
import numpy as np

a=np.arange(1,7).reshape(2,3)
b=np.ones((2,3))+1

print(a)     #输出结果：[[1 2 3] [4 5 6]]
print(a+2)   #加法操作，输出结果是：[[3 4 5] [6 7 8]]
print(a-2)   #减法操作，输出结果是：[[-1  0  1] [ 2  3  4]]
print(a*2)  #乘法操作，输出结果是：[[ 2  4  6] [ 8 10 12]]
print(2/a)  #除法操作，输出结果是：
#[ [2.         1.         0.66666667]
#                          [0.5        0.4        0.33333333]]

print(b)     #输出结果：[[2. 2. 2.] [2. 2. 2.]]
print(a+b)   #加法操作，输出结果是：[[3. 4. 5.] [6. 7. 8.]]
print(a-b)   #减法操作，输出结果是：[[-1.  0.  1.] [ 2.  3.  4.]]
print(a*b)  #乘法操作，输出结果是：[[ 2.  4.  6.] [ 8. 10. 12.]]
print(b/a)  #除法操作，输出结果是：
#[ [2.         1.         0.66666667]
#     [0.5        0.4        0.33333333]]


print(a==b)  #比较操作，输出结果是：[[False  True False] [False False False]]



